const { MessageEmbed } = require('discord.js');
const { prefix } = require(`${process.cwd()}/config`);

module.exports = {
    name: "advice",
    description: "Send helpful tips for server security and community management.",
    usage: `${prefix}advice`,
    run: async (client, message, args) => {
        const embed = new MessageEmbed()
            .setColor("#0099ff")
            .setTitle("نصائح يمكن أن تفيدك")
            .setDescription("إليك بعض النصائح لتجنب الجحفلة والحفاظ على أمان مجتمعك:")
            .addField("🚫 تجنب إعطاء الصلاحيات:", "لا تعطي أي صلاحيات أو رولات لأشخاص لا تعرفهم جيدًا. تأكد من معرفة الشخص قبل منحه أي صلاحيات.")
            .addField("🔒 تفعيل الحماية:", "تأكد من تفعيل جميع إعدادات الحماية المتاحة في السيرفر لحماية مجتمعك.")
            .addField("👁️‍🗨️ مراقبة الصلاحيات:", "عند إعطاء صلاحيات لأعضاء، تأكد من مراجعة الصلاحيات الممنوحة بعناية لتجنب أي مشاكل.")
            .addField("⚠️ تجنب الجحفلة:", "كن حذرًا عند إدخال أي تعديلات على إعدادات السيرفر وتجنب جميع أشكال الجحفلة.")
            .addField("🛡️ تذكر:", "دائمًا تحقق من إعدادات الأمان في السيرفر وكن حذرًا من الأعضاء الجدد.")
            .setFooter("حافظ على مجتمعك آمنًا");
        
        message.channel.send({ embeds: [embed] });
    }
};